In [13]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [74]:
#afficher le jeu de donnees 
df=pd.read_csv("insurance.csv")
df.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [29]:
#Afficher la dimensionnalité de votre jeu de données
df.shape

(1338, 7)

In [30]:
# virifier s'il a des valeur null
df.isnull().sum()

age         0
sex         0
bmi         0
children    0
smoker      0
region      0
charges     0
dtype: int64

In [31]:
#afficher le details
df.describe()

               age          bmi     children       charges
count  1338.000000  1338.000000  1338.000000   1338.000000
mean     39.207025    30.663397     1.094918  13270.422265
std      14.049960     6.098187     1.205493  12110.011237
min      18.000000    15.960000     0.000000   1121.873900
25%      27.000000    26.296250     0.000000   4740.287150
50%      39.000000    30.400000     1.000000   9382.033000
75%      51.000000    34.693750     2.000000  16639.912515
max      64.000000    53.130000     5.000000  63770.428010

In [32]:
#afficher les info
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1338 entries, 0 to 1337
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   age       1338 non-null   int64
 1   sex       1338 non-null   object
 2   bmi       1338 non-null   float64
 3   children  1338 non-null   int64
 4   smoker    1338 non-null   object
 5   region    1338 non-null   object
 6   charges   1338 non-null   float64
dtypes: float64(2), int64(2), object(3)
memory usage: 73.3+ KB

In [33]:
#les duplicates
df.duplicated().sum()

1

In [34]:
#le champs dupliquer
df[df.duplicated()]

     age   sex    bmi  children smoker     region    charges
581   19  male  30.59         0     no  northwest  1639.5631

In [75]:
# supprimer les lignes dup
df=df[df.duplicated() == False]

In [39]:
# verifier 
df.duplicated().sum()

0

In [76]:
df.columns

Index(['age', 'sex', 'bmi', 'children', 'smoker', 'region', 'charges'], dtype='object')

In [77]:
df['sex'].value_counts()

sex
male      675
female    662
Name: count, dtype: int64

In [78]:
sex = pd.get_dummies(df['sex'],drop_first=True).astype(int)
sex

      male
0        0
1        1
2        1
3        1
4        1
...    ...
1333     1
1334     0
1335     0
1336     0
1337     0

[1337 rows x 1 columns]

In [79]:
df.drop('sex',axis=1,inplace=True)

In [80]:
df=pd.concat([df,sex],axis=1)
df

      age     bmi  children smoker     region      charges  male
0      19  27.900         0    yes  southwest  16884.92400     0
1      18  33.770         1     no  southeast   1725.55230     1
2      28  33.000         3     no  southeast   4449.46200     1
3      33  22.705         0     no  northwest  21984.47061     1
4      32  28.880         0     no  northwest   3866.85520     1
...   ...     ...       ...    ...        ...          ...   ...
1333   50  30.970         3     no  northwest  10600.54830     1
1334   18  31.920         0     no  northeast   2205.98080     0
1335   18  36.850         0     no  southeast   1629.83350     0
1336   21  25.800         0     no  southwest   2007.94500     0
1337   61  29.070         0    yes  northwest  29141.36030     0

[1337 rows x 7 columns]

In [81]:
def changer_smoker():
    if

ValueError: could not convert string to float: 'yes'